In [1]:
import pandas as pd

# Series

In [2]:
# Create a series

ser = pd.Series([3,4,5,6,7])

In [3]:
ser

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [4]:
type(ser)

pandas.core.series.Series

In [5]:
ser2 = pd.Series(['Apple', 4,'Mango','Grapes',[3,4,'Yashraj'], 'Oranges'])
ser2

0              Apple
1                  4
2              Mango
3             Grapes
4    [3, 4, Yashraj]
5            Oranges
dtype: object

In [6]:
ser2[1]

4

In [7]:
ser3 = pd.Series([5,4,7,8,9,1,2])

ser3[::]

0    5
1    4
2    7
3    8
4    9
5    1
6    2
dtype: int64

In [8]:
ser4 = pd.Series([1,2,3,4,5], index=['k1', 'k2', 'k3','k4','k5']) #this modifies indexing values according to the user

ser4

k1    1
k2    2
k3    3
k4    4
k5    5
dtype: int64

In [9]:
ser4['k1':'k4'] #whie assigning the indexing value dont go for n+1 indexing rule in Series

k1    1
k2    2
k3    3
k4    4
dtype: int64

In [10]:
dataset = pd.read_csv('Data.csv') #uploads the dataset and reads it

In [11]:
dataset.head() #displays first 5 entries of dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [12]:
dataset.tail() #displays last 5 entries of dataset

   Country   Age   Salary Purchased
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [13]:
dataset.shape #To pprint the size of dataset

(10, 4)

In [14]:
dataset.Country #To see particular column from dataset

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [15]:
#OR

In [16]:
dataset['Country'] # this method is used when there is a space between he name off attribue

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

# Dataframe

In [17]:
# Create a dataset

df = pd.DataFrame([[1,2,3,4,5,6], [2,3,4,5,6,7], [3,4,5,6,7,8]])
df

   0  1  2  3  4  5
0  1  2  3  4  5  6
1  2  3  4  5  6  7
2  3  4  5  6  7  8

In [18]:
df.columns=['C1', 'C2', 'C3', 'C4', 'C5', 'C6'] #To change name of columns

df.index=['R1','R2','R3'] #To change name of rows

In [19]:
df

    C1  C2  C3  C4  C5  C6
R1   1   2   3   4   5   6
R2   2   3   4   5   6   7
R3   3   4   5   6   7   8

In [20]:
import numpy as np # to define nan value

In [21]:
#Creating a DataFrame from Dictionary:

d = {'name':['A','B','C','D','E'], 'Age':[19,15,np.nan,18,17], 'Gender':['M','F','M','M','F']}

df2 = pd.DataFrame(d)

In [22]:
df2

  name   Age Gender
0    A  19.0      M
1    B  15.0      F
2    C   NaN      M
3    D  18.0      M
4    E  17.0      F

In [23]:
df2.Gender

0    M
1    F
2    M
3    M
4    F
Name: Gender, dtype: object

In [24]:
# To add one more column

df2['Salary']=[65000,55000,45000,35000,25000]

df2

  name   Age Gender  Salary
0    A  19.0      M   65000
1    B  15.0      F   55000
2    C   NaN      M   45000
3    D  18.0      M   35000
4    E  17.0      F   25000

In [25]:
# To check number of null values in our dataset

df2.isnull().sum()

name      0
Age       1
Gender    0
Salary    0
dtype: int64

In [26]:
# To insert the mean value in place of null value

df2['Age'] = df2['Age'].fillna(df2['Age'].mean())

#OR

#df2.Age = df2.Age.fillna(df2.Age.median())

df2

  name    Age Gender  Salary
0    A  19.00      M   65000
1    B  15.00      F   55000
2    C  17.25      M   45000
3    D  18.00      M   35000
4    E  17.00      F   25000

In [27]:
# IF YOU ARE DROPPING A COLUMN: axis=1
# IF YOU ARE DROPPING A ROW: axis=0

dff = df2.drop(['Salary'], axis=1)

dff

  name    Age Gender
0    A  19.00      M
1    B  15.00      F
2    C  17.25      M
3    D  18.00      M
4    E  17.00      F

In [28]:
df2

  name    Age Gender  Salary
0    A  19.00      M   65000
1    B  15.00      F   55000
2    C  17.25      M   45000
3    D  18.00      M   35000
4    E  17.00      F   25000

In [29]:
dfr = df2.drop(3,axis=0)

dfr

  name    Age Gender  Salary
0    A  19.00      M   65000
1    B  15.00      F   55000
2    C  17.25      M   45000
4    E  17.00      F   25000

In [30]:
df2.info() #To get more information of columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   Age     5 non-null      float64
 2   Gender  5 non-null      object
 3   Salary  5 non-null      int64
dtypes: float64(1), int64(1), object(2)
memory usage: 192.0+ bytes

In [31]:
df2.describe() # Descriptive statistics

            Age        Salary
count   5.00000      5.000000
mean   17.25000  45000.000000
std     1.47902  15811.388301
min    15.00000  25000.000000
25%    17.00000  35000.000000
50%    17.25000  45000.000000
75%    18.00000  55000.000000
max    19.00000  65000.000000

In [32]:
# Mean or median - numerical features
# mode - Categorical Feature

In [33]:
df2.Age.median()

17.25

In [34]:
df2.Age.mean()

17.25

In [35]:
df2.Gender.mode()

0    M
Name: Gender, dtype: object

In [36]:
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [37]:
# SLICING OPERATORS:

#loc - location
#iloc - index location

In [38]:
dataset.loc[3] #Displays the mentioned entry(index)

Country        Spain
Age             38.0
Salary       61000.0
Purchased         No
Name: 3, dtype: object

In [39]:
#Syntax
"""
loc[:,:]
iloc[:,:]

"""

'\nloc[:,:]\niloc[:,:]\n\n'

In [40]:
dataset.loc[1:3, 'Country':'Salary']

   Country   Age   Salary
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0

In [41]:
dataset.iloc[1:3, 0:3]

   Country   Age   Salary
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0

In [42]:
dataset.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [43]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 312.0+ bytes

# ENCODING

In [44]:
# Converting object to  int/float

'''

(1) One hot Encoding (for small dataset)
(2) Label Encoding
(3) Manual Encoding

'''

'\n\n(1) One hot Encoding (for small dataset)\n(2) Label Encoding\n(3) Manual Encoding\n\n'

In [45]:
# One Hot Encoding

In [46]:
pd.get_dummies(dataset['Country']) # get_dummies convert categorical variable to numerical variable 

# If in a particular column the given categorical variable is present then it will show 1 in that instance.

   France  Germany  Spain
0       1        0      0
1       0        0      1
2       0        1      0
3       0        0      1
4       0        1      0
5       1        0      0
6       0        0      1
7       1        0      0
8       0        1      0
9       1        0      0

In [47]:
df2

  name    Age Gender  Salary
0    A  19.00      M   65000
1    B  15.00      F   55000
2    C  17.25      M   45000
3    D  18.00      M   35000
4    E  17.00      F   25000

In [48]:
one_hot = pd.get_dummies(df2['Gender'])

In [49]:
df2

  name    Age Gender  Salary
0    A  19.00      M   65000
1    B  15.00      F   55000
2    C  17.25      M   45000
3    D  18.00      M   35000
4    E  17.00      F   25000

In [50]:
# To join dummies to original table

df3 = df2.join(one_hot)

df3

  name    Age Gender  Salary  F  M
0    A  19.00      M   65000  0  1
1    B  15.00      F   55000  1  0
2    C  17.25      M   45000  0  1
3    D  18.00      M   35000  0  1
4    E  17.00      F   25000  1  0

In [51]:
df3.drop('Gender', axis=1)

  name    Age  Salary  F  M
0    A  19.00   65000  0  1
1    B  15.00   55000  1  0
2    C  17.25   45000  0  1
3    D  18.00   35000  0  1
4    E  17.00   25000  1  0

In [52]:
#Label Encoding

from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

In [53]:
df3.name.unique()

array(['A', 'B', 'C', 'D', 'E'], dtype=object)

In [54]:
df3.name = le.fit_transform(df3.name)

In [55]:
df3

   name    Age Gender  Salary  F  M
0     0  19.00      M   65000  0  1
1     1  15.00      F   55000  1  0
2     2  17.25      M   45000  0  1
3     3  18.00      M   35000  0  1
4     4  17.00      F   25000  1  0

In [56]:
le.inverse_transform([2])

array(['C'], dtype=object)

In [57]:
# Manual Encoding